---
kind: property
id: P:Autodesk.Revit.DB.ScheduleField.ParameterId
source: html/ecad009d-a968-2adc-9891-128e9ee8074a.htm
---
# Autodesk.Revit.DB.ScheduleField.ParameterId Property

The ID of the parameter displayed by the field.

## Syntax (C#)
```csharp
public ElementId ParameterId { get; }
```

## Remarks
Most field types require a parameter ID. Count, Formula, and Percentage
 fields don't have parameter IDs.